name: "preprocess"
backend: "python"
max_batch_size: 0

input [
  {
    name: "RAW_IMAGE"
    data_type: TYPE_UINT8
    dims: [-1]  # Variable length raw image bytes
  }
]

output [
  {
    name: "data"
    data_type: TYPE_FP32
    dims: [1, 3, 224, 224]  # CHW format for typical image models
  }
]

instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]
