name: "squeezenet_onnx"
platform: "onnxruntime_onnx"

# Disable batching by setting max_batch_size to 0
max_batch_size: 0

input [
  {
    name: "data"
    data_type: TYPE_FP32

    # Include the batch dim explicitly since we're not batching
    dims: [1, 3, 224, 224]
  }
]

output [
  {
    name: "squeezenet0_flatten0_reshape0"
    data_type: TYPE_FP32
    dims: [1, 1000]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]
