name: "resnet50_onnx"
platform: "onnxruntime_onnx"
max_batch_size: 0
input [
  {
    name: "data"
    data_type: TYPE_FP32
    dims: [1, 3, 224, 224]
  }
]
output [
  {
    name: "resnetv17_dense0_fwd"
    data_type: TYPE_FP32
    dims: [-1, 1000]
  }
]
instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]

